// 시도구군 정보 리스트
const sidoGugunList = [
	['A01', '서울', ['강남구', '관악구', '동작구', '서초구', '종로구', '중구']],
	['A02', '서울', ['강동구', '광진구', '성동구', '송파구']],
	['A03', '서울', ['마포구', '서대문구', '용산구', '은평구']],
	['A04', '서울', ['강서구', '구로구', '금천구', '양천구', '영등포구']],
	['A05', '서울', ['성북구', '강북구', '노원구', '도봉구', '동대문구', '중랑구']],
	['D01', '경기', ['가평군', '구리시', '남양주시', '동두천시', '양주시', '연천군', '의정부시', '포천시']],
	['D01', '강원', ['철원군']],
	['D02', '경기', ['고양시', '파주시']],
	['E01', '경기', ['수원시', '오산시', '용인시', '화성시']],
	['E02', '경기', ['광주시', '성남시', '하남시']],
	['E03', '경기', ['양평군', '여주군', '이천시', '여주시']],
	['E04', '경기', ['안성시', '평택시']],
	['E05', '경기', ['광명시', '시흥시', '안산시']],
	['E06', '경기', ['과천시', '군포시', '안양시', '의왕시']],
	['C02', '경기', ['김포시', '부천시']],
	['C01', '인천', ['강화군', '계양구', '남구', '남동구', '동구', '부평구', '서구', '연수구', '옹진군', '중구']],
	['F01', '강원', ['양구군', '인제군', '춘천시', '홍천군', '화천군']],
	['F02', '강원', ['강릉시', '동해시', '삼척시']],
	['F03', '강원', ['고성군', '속초시', '양양군']],
	['F04', '강원', ['원주시', '횡성군']],
	['F05', '강원', ['영월군', '정선군', '태백시', '평창군']],
	['G01', '충북', ['괴산군', '보은군', '증평군', '진천군', '청원군', '청주시']],
	['G02', '충북', ['음성군', '충주시']],
	['G03', '충북', ['단양군', '제천시']],
	['G04', '충북', ['영동군', '옥천군']],
	['H01', '대전', ['대덕구', '동구', '서구', '유성구', '중구']],
	['H01', '충남', ['금산군', '연기군']],
	['H02', '충남', ['천안시', '아산시']],
	['H03', '충남', ['공주시', '청양군']],
	['H04', '충남', ['당진군', '서산시', '태안군', '당진시']],
	['H05', '충남', ['보령시', '서천군', '예산군', '홍성군']],
	['H06', '충남', ['계룡시', '논산시', '부여군']],
  ['H01', '세종', ['세종']],
	['L01', '전남', ['나주시', '화순군', '장성군', '담양군', '곡성군', '영광군']],
	['L01', '광주', ['광산구', '남구', '동구', '북구', '서구']],
	['L02', '전남', ['고흥군', '광양시', '구례군', '보성군', '순천시', '여수시']],
	['L03', '전남', ['목포시', '무안군', '신안군', '영암군', '함평군']],
  ['L02', '전남', ['여수시']],
	['L04', '전남', ['강진군', '장흥군']],
	['L05', '전남', ['완도군', '진도군', '해남군']],
	['K01', '전북', ['김제시', '무주군', '완주군', '임실군', '전주시', '진안군']],
	['K02', '전북', ['군산시', '익산시']],
	['K03', '전북', ['남원시', '순창군', '장수군']],
	['K04', '전북', ['고창군', '부안군', '정읍시']],
	['I01', '경북', ['경산시', '영천시', '청도군', '칠곡군']],
	['I02', '경북', ['경주시']],
	['I03', '경북', ['구미시', '김천시']],
	['I04', '경북', ['문경시', '상주시', '예천군']],
	['I05', '경북', ['봉화군', '안동시', '영주시']],
	['I06', '경북', ['영덕군', '영양군', '울진군']],
	['I07', '경북', ['군위군', '의성군', '청송군']],
	['I08', '경북', ['울릉군', '포항시']],
	['I09', '경북', ['고령군', '성주군']],
	['J01', '경남', ['김해시', '의령군', '진해시', '창원시', '함안군']],
	['J02', '경남', ['거창군', '함양군', '합천군']],
	['J03', '경남', ['밀양시', '창녕군']],
	['J04', '경남', ['남해군', '사천시', '산청군', '진주시', '하동군']],
	['J05', '경남', ['거제시', '고성군', '통영시']],
	['J06', '경남', ['마산시']],
	['N01', '경남', ['양산시']],
	['I01', '대구', ['동구', '남구', '북구', '중구', '수성구']],
	['I09', '대구', ['서구', '달서구', '달성군']],
	['N01', '울산', ['남구', '동구', '북구', '울주군', '중구']],
	['B01', '부산', ['금정구', '동구', '동래구', '부산진구', '연제구', '영도구', '중구']],
	['B02', '부산', ['기장군', '남구', '수영구', '해운대구']],
	['B03', '부산', ['강서구', '북구', '사상구', '사하구', '서구']],
	['M01', '제주', ['서귀포시', '제주시']]
];

const sidoList = ['서울', '경기', '인천', '강원', '충북', '충남', '대전', '세종',
          '전북', '전남', '광주', '경북', '경남', '대구', '울산', '부산', '제주'];

const gugunList = new Array();
gugunList[0] = ['강남구', '강동구', '강북구', '강서구', '관악구', '광진구', '구로구', '금천구', '노원구', '도봉구', '동대문구', '동작구',
          '마포구', '서대문구', '서초구', '성동구', '성북구', '송파구', '양천구', '영등포구', '용산구', '은평구', '종로구', '중구', '중랑구'];
gugunList[1] = ['가평군', '고양시', '과천시', '광명시', '광주시', '구리시', '군포시', '김포시', '남양주시', '동두천시', '부천시', '성남시',
          '수원시', '시흥시', '안산시', '안성시', '안양시', '양주시', '양평군', '여주군', '여주시', '연천군', '오산시', '용인시', '의왕시',
          '의정부시', '이천시', '파주시', '평택시', '포천시', '하남시', '화성시'];
gugunList[2] = ['강화군', '계양구', '남구', '남동구', '동구', '부평구', '서구', '연수구', '옹진군', '중구'];
gugunList[3] = ['강릉시', '고성군', '동해시', '삼척시', '속초시', '양구군', '양양군', '영월군', '원주시', '인제군', '정선군', '철원군',
          '춘천시', '태백시', '평창군', '홍천군', '화천군', '횡성군'];
gugunList[4] = ['괴산군', '단양군', '보은군', '영동군', '옥천군', '음성군', '제천시', '증평군', '진천군', '청원군', '청주시', '충주시'];
gugunList[5] = ['계룡시', '공주시', '금산군', '논산시', '당진군', '당진시', '보령시', '부여군', '서산시', '서천군', '아산시', '연기군',
          '예산군', '천안시', '청양군', '태안군', '홍성군'];
gugunList[6] = ['대덕구', '동구', '서구', '유성구', '중구'];
gugunList[7] = ['세종'];
gugunList[8] = ['고창군', '군산시', '김제시', '남원시', '무주군', '부안군', '순창군', '완주군', '익산시', '임실군', '장수군', '전주시',
          '정읍시', '진안군'];
gugunList[9] = ['강진군', '고흥군', '곡성군', '광양시', '구례군', '나주시', '담양군', '목포시', '무안군', '보성군', '순천시', '신안군',
          '여수시', '영광군', '영암군', '완도군', '장성군', '장흥군', '진도군', '함평군', '해남군', '화순군'];
gugunList[10] = ['광산구', '남구', '동구', '북구', '서구'];
gugunList[11] = ['경산시', '경주시', '고령군', '구미시', '군위군', '김천시', '문경시', '봉화군', '상주시', '성주군', '안동시', '영덕군',
          '영양군', '영주시', '영천시', '예천군', '울릉군', '울진군', '의성군', '청도군', '청송군', '칠곡군', '포항시'];
gugunList[12] = ['거제시', '거창군', '고성군', '김해시', '남해군', '마산시', '밀양시', '사천시', '산청군', '양산시', '의령군', '진주시',
          '진해시', '창녕군', '창원시', '통영시', '하동군', '함안군', '함양군', '합천군'];
gugunList[13] = ['남구', '달서구', '달성군', '동구', '북구', '서구', '수성구', '중구'];
gugunList[14] = ['남구', '동구', '북구', '울주군', '중구'];
gugunList[15] = ['강서구', '금정구', '기장군', '남구', '동구', '동래구', '부산진구', '북구', '사상구', '사하구', '서구', '수영구', '연제구',
          '영도구', '중구', '해운대구'];
gugunList[16] = ['서귀포시', '제주시'];

const result_list_conf = {
	list_count : 10
}


/*
// orientDB Connection info
const db_info = {
  host : 'localhost',
  port : 2424,
  username : 'root',
  password : 'hope313'
};

function dbconn(host, port, id, pwd) {
  if(host == undefined) host = db_info.host;
  if(port == undefined) port = db_info.port;
  if(id == undefined) id = db_info.username;
  if(pwd == undefined) pwd = db_info.password;

  var OrientDB = require('orientjs');

  return OrientDB({
    host : host,
    port : port,
    username : id,
    password : pwd
  });
}
*/

module.exports.sidoGugunList = sidoGugunList;
//module.exports.dbconn = dbconn;
module.exports.sidoList = sidoList;
module.exports.gugunList = gugunList;
module.exports.result_list_conf = result_list_conf;
